Amiya200/stm32_water_tank/Core/Src/model_handle.c
        timerActive = true;
        motorOwner  = MOTOR_OWNER_TIMER;

        timerState = TIMER_STATE_ON;
        timerStateDeadline = 0;
    }

    if (timerActive && !slotActive)
    {
        motorOwner = MOTOR_OWNER_TIMER;
        stop_motor();

        timerActive = false;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;

        restore_previous_mode();

        previousOwner     = MOTOR_OWNER_NONE;
        previousManual    = false;
        previousSemi      = false;
        previousCountdown = false;
        previousAuto      = false;

        ModelHandle_SaveModeState();
        return;
    }

    if (!timerActive)
        return;

    if (isTankFull())
    {
        motorOwner = MOTOR_OWNER_TIMER;
        stop_motor();
        return;
    }

    uint32_t gapMs = timer_get_gap_ms();

    if (gapMs == 0)
    {
        ModelHandle_CheckDryRun();

        motorOwner = MOTOR_OWNER_TIMER;

        if (senseDryRun)
        {
            if (!Motor_GetStatus())
                start_motor();
        }
        else
        {
            if (Motor_GetStatus())
                stop_motor();
        }
        return;
    }

    switch (timerState)
    {
        case TIMER_STATE_ON:
        {
            if (timerStateDeadline == 0)
            {
                timerStateDeadline = now + gapMs;
                motorOwner = MOTOR_OWNER_TIMER;
                start_motor();
            }

            if (now >= timerStateDeadline)
            {
                motorOwner = MOTOR_OWNER_TIMER;
                stop_motor();

                timerState = TIMER_STATE_OFF;
                timerStateDeadline = now + gapMs;
            }
        }
        break;

        case TIMER_STATE_OFF:
        {
            motorOwner = MOTOR_OWNER_TIMER;

            stop_motor();  // force OFF, no condition

            if (now >= timerStateDeadline)
            {
                ModelHandle_CheckDryRun();

                if (senseDryRun)
                {
                    timerState = TIMER_STATE_ON;
                    timerStateDeadline = now + gapMs;
                }
                else
                {
                    timerStateDeadline = now + gapMs;
                }
            }
        }
        break;
        default:
        {
            timerState = TIMER_STATE_ON;
            timerStateDeadline = 0;
        }
        break;
    }
}


void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;   // ADD THIS
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;
    motorOwner = MOTOR_OWNER_SEMIAUTO;
    senseDryRun = false;
    if (!isTankFull())
        start_motor();
}
void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static bool autoStartedByUART = false;
void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint16_t retry)
{
    if (autoActive) return;   // prevent retrigger

    autoStartedByUART = true;   // <---- IMPORTANT

    clear_all_modes();
    autoActive       = true;
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoState        = AUTO_ON_WAIT;

    ModelHandle_SaveModeState();
    request_mode_switch(MOTOR_OWNER_AUTO);

    autoDeadline = now_ms() + gap_s * 1000UL;
}
void ModelHandle_StopAuto(void)
{
    autoStartedByUART = false;   // <---- IMPORTANT

    stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;

    EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME,
                       (uint8_t[]){0},
                       sizeof(AutoRuntimeBlock));

    ModelHandle_SaveModeState();
}


void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
    AutoRuntimeBlock b;
    EEPROM_ReadBuffer(EE_ADDR_AUTO_RUNTIME,(uint8_t*)&b,sizeof(b));
    if(b.sig != AUTO_SIG) return;
    if(AUTO_CRC((uint8_t*)&b,sizeof(b)-1) != b.crc) return;
    if(!b.active) return;
    autoActive       = true;
    autoState        = (AutoState)b.state;
    auto_retry_count = b.retryCount;
    autoDeadline     = now_ms() + b.remaining_ms;
    autoResumeBoot   = true;
    start_motor();
}
static uint8_t get_tank_level_percent(void)
{
    uint8_t submerged = 0;

    for (int i = 0; i <= 3; i++)
    {
        if (adcData.voltages[i] < 0.10f)
            submerged++;
    }

    return (submerged * 100) / 4;
}
static void auto_mode_background_control(void)
{
    static bool autoWasStartedByLevel = false;

    if (suppressAutoOneCycle)
    {
        suppressAutoOneCycle = false;
        return;
    }

    uint8_t level = get_tank_level_percent();

    if (manualActive || semiAutoActive ||
        timerActive || timer_any_active_slot() ||
        countdownActive || twistActive)

    {
        autoWasStartedByLevel = false;
        return;
    }

    if (!autoActive && level <= AUTO_START_LEVEL_PERCENT)
    {
        ModelHandle_StartAuto(auto_gap_s,
                              auto_maxrun_min,
                              auto_retry_limit);
        autoWasStartedByLevel = true;
    }

    if (autoActive &&
        autoWasStartedByLevel &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
        autoWasStartedByLevel = false;
    }
}


static void auto_tick(void)
{
    if (!autoActive)
        return;

    /* Do not interfere during mode switching delay */
    if (modeSwitchPending)
        return;

    uint32_t now = now_ms();

