Amiya200/stm32_water_tank/Core/Src/model_handle.c
    /* Periodically save runtime to EEPROM (every 5 sec) */
    static uint32_t lastSave = 0;
    if ((now - lastSave) >= 5000UL)
    {
        lastSave = now;
        SaveAutoRuntime();
    }
    if (isTankFull())
    {
        stop_motor();
        autoActive = false;
        autoState  = AUTO_IDLE;
        auto_retry_count = 0;

        EEPROM_WriteBuffer(EE_ADDR_AUTO_RUNTIME,
                           (uint8_t[]){0},
                           sizeof(AutoRuntimeBlock));

        buzzerContinuous = true;
        buzzerAlertUntil = HAL_GetTick() + 10000UL;  // 10 seconds

        return;
    }


    /* Resume after power restore */
    if (autoResumeBoot)
    {
        autoResumeBoot = false;

        if (autoState == AUTO_ON_WAIT ||
            autoState == AUTO_DRY_CHECK)
        {
            motorOwner = MOTOR_OWNER_AUTO;
            start_motor();
        }
        else
        {
            stop_motor();
        }

        return;
    }

    switch (autoState)
    {
        /* ===========================
           AUTO RUN PHASE
           =========================== */
        case AUTO_ON_WAIT:
        {
            motorOwner = MOTOR_OWNER_AUTO;
            start_motor();

            if (now >= autoDeadline)
            {
                autoState = AUTO_DRY_CHECK;
            }
        }
        break;

        /* ===========================
           DRY CHECK PHASE
           =========================== */
        case AUTO_DRY_CHECK:
        {
            ModelHandle_CheckDryRun();

            /* If DRY → stop and wait */
            if (senseDryRun)
            {
                stop_motor();

                autoState = AUTO_OFF_WAIT;
                autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;

                Buzzer_TriggerAlert();
            }
            else
            {
                /* Water available → continue running */
                autoState = AUTO_ON_WAIT;
                autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;
            }
        }
        break;

        /* ===========================
           OFF WAIT PHASE
           =========================== */
        case AUTO_OFF_WAIT:
        {
            if (now >= autoDeadline)
            {
                auto_retry_count++;
                auto_retry_counter = auto_retry_count;

                /* Retry limit check */
                if (auto_retry_limit &&
                    auto_retry_count > auto_retry_limit)
                {
                    stop_motor();
                    autoActive = false;
                    autoState  = AUTO_IDLE;
                    Buzzer_TriggerAlert();
                    return;
                }

                /* Retry start */
                motorOwner = MOTOR_OWNER_AUTO;
                start_motor();

                autoState = AUTO_ON_WAIT;
                autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;
            }
        }
        break;

        default:
        {
            autoState = AUTO_IDLE;
        }
        break;
    }
}
void ModelHandle_StartCountdown(uint32_t seconds)
{
    clear_all_modes();
    if (seconds == 0) return;

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;
    ModelHandle_SaveModeState();
    start_motor();
}
void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}
static void countdown_tick(void)
{
    if (!countdownActive) return;
    uint32_t now = now_ms();
    if (isTankFull())
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }
    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }
    countdownDuration = (cd_deadline - now) / 1000UL;
    static uint32_t lastSave = 0;
    if ((now - lastSave) >= 5000UL)
    {
        lastSave = now;
        SaveCountdown();
    }
}
static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}
static void SaveCountdown(void)
{
    CountdownBlock b;
    b.sig = CD_SIGNATURE;
    b.remaining = countdownDuration;
    b.active = countdownActive;
    b.crc = CD_CRC((uint8_t*)&b,sizeof(b)-2);

    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
}
void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
    if(b.sig!=CD_SIGNATURE) return;
    if(CD_CRC((uint8_t*)&b,sizeof(b)-2)!=b.crc) return;
    if(b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline = now_ms() + b.remaining * 1000UL;   // <<< FIX
        start_motor();
    }
}
void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}
void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed) return;
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;
        twist_on_phase = true;
        twist_deadline = now_ms() +
                         twistSettings.onDurationSeconds * 1000UL;
        start_motor();
    }
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}
static void twist_tick(void)
{
	if (!twistActive) return;
	    if (isTankFull())
	    {
	        ModelHandle_StopTwist();
	        Buzzer_TriggerAlert();
	        return;
	    }
    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor();
    else stop_motor();
}
static void protections_tick(void)
{
    if (senseMaxRunReached)
        stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    if (!senseDryRun)
    {
        if (motorOn)
            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);
        else
            LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);
    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}
void ModelHandle_Process(void)
{
	if (modeSwitchPending)
	{
	    if (HAL_GetTick() >= modeSwitchTime)
	    {
	        modeSwitchPending = false;
	        motorOwner = pendingOwner;
	        start_motor();
	    }
	    return;
	}
	/* ================= RESTART MODE ================= */

	if (restartActive)
	{
	    if (isTankFull())
	    {
	        ModelHandle_StopRestart();
	        Buzzer_TriggerAlert();
	        leds_from_model();
	        Buzzer_Update();
	        return;
	    }
	    if (!Motor_GetStatus())
	        start_motor();

	    leds_from_model();
	    Buzzer_Update();
	    return;
	}

	auto_mode_background_control();
	ModelHandle_ProcessTimerSlots();

    ModelHandle_CheckLoadFault();
    protections_tick();
    twist_time_logic();
    check_max_run();
    ModelHandle_SoftDryRunHandler();
    if (senseMaxRunReached)
    {
        stop_motor();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (manualActive)
    {
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (autoActive)
    {
        auto_tick();
        leds_from_model();
        Buzzer_Update();
        return;
    }
    if (semiAutoActive)
    {

